### Imports

In [8]:
import os
import re
from pathlib import Path
import pandas as pd
import numpy as np
import altair as alt
from typing import Dict

### Load dataset

In [9]:


def load_csv(path: Path, **kwargs):
    df = pd.read_csv(path, **kwargs)
    print(f"Loaded {path}: {df.shape[0]} rows, {df.shape[1]} cols")
    return df

DATA_DIR = Path("../data")
dfs: Dict[str, pd.DataFrame] = {}

dfs['companies'] = load_csv(DATA_DIR / 'companies' / 'companies.csv')
dfs['company_industries'] = load_csv(DATA_DIR / 'companies' / 'company_industries.csv')
dfs['company_specialities'] = load_csv(DATA_DIR / 'companies' / 'company_specialities.csv')
dfs['employee_counts'] = load_csv(DATA_DIR / 'companies' / 'employee_counts.csv')

dfs['benefits'] = load_csv(DATA_DIR / 'jobs' / 'benefits.csv')
dfs['job_industries'] = load_csv(DATA_DIR / 'jobs' / 'job_industries.csv')
dfs['job_skills'] = load_csv(DATA_DIR / 'jobs' / 'job_skills.csv')
dfs['salaries'] = load_csv(DATA_DIR / 'jobs' / 'salaries.csv')

dfs['industries'] = load_csv(DATA_DIR / 'mappings' / 'industries.csv')
dfs['skills'] = load_csv(DATA_DIR / 'mappings' / 'skills.csv')

dfs['postings'] = load_csv(DATA_DIR / 'postings.csv', low_memory=False)

Loaded ../data/companies/companies.csv: 24473 rows, 10 cols
Loaded ../data/companies/company_industries.csv: 24375 rows, 2 cols
Loaded ../data/companies/company_specialities.csv: 169387 rows, 2 cols
Loaded ../data/companies/employee_counts.csv: 35787 rows, 4 cols
Loaded ../data/jobs/benefits.csv: 67943 rows, 3 cols
Loaded ../data/jobs/job_industries.csv: 164808 rows, 2 cols
Loaded ../data/jobs/job_skills.csv: 213768 rows, 2 cols
Loaded ../data/jobs/salaries.csv: 40785 rows, 8 cols
Loaded ../data/mappings/industries.csv: 422 rows, 2 cols
Loaded ../data/mappings/skills.csv: 35 rows, 2 cols
Loaded ../data/postings.csv: 123849 rows, 31 cols

In [10]:

for k in ['companies', 'postings', 'salaries', 'job_skills', 
          'benefits', 'employee_counts', 'industries', 'skills',
          'company_industries', 'company_specialities', 'job_industries']:
    print(f"Preview of {k} — {dfs[k].shape[0]} rows × {dfs[k].shape[1]} cols")
    display(dfs[k].head(5))

Preview of companies — 24473 rows × 10 cols

,company_id,name,description,company_size,state,country,city,zip_code,address,url
0,1009,IBM,"At IBM, we do more than work. We create. We cr...",7.0,NY,US,"Armonk, New York",10504,International Business Machines Corp.,https://www.linkedin.com/company/ibm
1,1016,GE HealthCare,Every day millions of people feel the impact o...,7.0,0,US,Chicago,0,-,https://www.linkedin.com/company/gehealthcare
2,1025,Hewlett Packard Enterprise,Official LinkedIn of Hewlett Packard Enterpris...,7.0,Texas,US,Houston,77389,1701 E Mossy Oaks Rd Spring,https://www.linkedin.com/company/hewlett-packa...
3,1028,Oracle,We’re a cloud technology company that provides...,7.0,Texas,US,Austin,78741,2300 Oracle Way,https://www.linkedin.com/company/oracle
4,1033,Accenture,Accenture is a leading global professional ser...,7.0,0,IE,Dublin 2,0,Grand Canal Harbour,https://www.linkedin.com/company/accenture

Preview of postings — 123849 rows × 31 cols

,job_id,company_name,title,description,max_salary,pay_period,location,company_id,views,med_salary,...,skills_desc,listed_time,posting_domain,sponsored,work_type,currency,compensation_type,normalized_salary,zip_code,fips
0,921716,Corcoran Sawyer Smith,Marketing Coordinator,Job descriptionA leading real estate firm in N...,20.0,HOURLY,"Princeton, NJ",2774458.0,20.0,NaN,...,Requirements: \n\nWe are seeking a College or ...,1.713398e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,38480.0,8540.0,34021.0
1,1829192,NaN,Mental Health Therapist/Counselor,"At Aspen Therapy and Wellness , we are committ...",50.0,HOURLY,"Fort Collins, CO",NaN,1.0,NaN,...,NaN,1.712858e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,83200.0,80521.0,8069.0
2,10998357,The National Exemplar,Assitant Restaurant Manager,The National Exemplar is accepting application...,65000.0,YEARLY,"Cincinnati, OH",64896719.0,8.0,NaN,...,We are currently accepting resumes for FOH - A...,1.713278e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,55000.0,45202.0,39061.0
3,23221523,"Abrams Fensterman, LLP",Senior Elder Law / Trusts and Estates Associat...,Senior Associate Attorney - Elder Law / Trusts...,175000.0,YEARLY,"New Hyde Park, NY",766262.0,16.0,NaN,...,This position requires a baseline understandin...,1.712896e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,157500.0,11040.0,36059.0
4,35982263,NaN,Service Technician,Looking for HVAC service tech with experience ...,80000.0,YEARLY,"Burlington, IA",NaN,3.0,NaN,...,NaN,1.713452e+12,NaN,0,FULL_TIME,USD,BASE_SALARY,70000.0,52601.0,19057.0

Preview of salaries — 40785 rows × 8 cols

,salary_id,job_id,max_salary,med_salary,min_salary,pay_period,currency,compensation_type
0,1,3884428798,NaN,20.0,NaN,HOURLY,USD,BASE_SALARY
1,2,3887470552,25.0,NaN,23.0,HOURLY,USD,BASE_SALARY
2,3,3884431523,120000.0,NaN,100000.0,YEARLY,USD,BASE_SALARY
3,4,3884911725,200000.0,NaN,10000.0,YEARLY,USD,BASE_SALARY
4,5,3887473220,35.0,NaN,33.0,HOURLY,USD,BASE_SALARY

Preview of job_skills — 213768 rows × 2 cols

       job_id skill_abr
0  3884428798      MRKT
1  3884428798        PR
2  3884428798       WRT
3  3887473071      SALE
4  3887465684       FIN

Preview of benefits — 67943 rows × 3 cols

       job_id  inferred                     type
0  3887473071         0        Medical insurance
1  3887473071         0         Vision insurance
2  3887473071         0         Dental insurance
3  3887473071         0                   401(k)
4  3887473071         0  Student loan assistance

Preview of employee_counts — 35787 rows × 4 cols

   company_id  employee_count  follower_count  time_recorded
0      391906             186           32508     1712346173
1    22292832             311            4471     1712346173
2       20300            1053            6554     1712346173
3     3570660             383           35241     1712346173
4      878353              52           26397     1712346173

Preview of industries — 422 rows × 2 cols

   industry_id                         industry_name
0            1       Defense and Space Manufacturing
1            3       Computer Hardware Manufacturing
2            4                  Software Development
3            5          Computer Networking Products
4            6  Technology, Information and Internet

Preview of skills — 35 rows × 2 cols

  skill_abr          skill_name
0       ART        Art/Creative
1      DSGN              Design
2      ADVR         Advertising
3      PRDM  Product Management
4      DIST        Distribution

Preview of company_industries — 24375 rows × 2 cols

   company_id                        industry
0      391906  Book and Periodical Publishing
1    22292832                    Construction
2       20300                         Banking
3     3570660  Book and Periodical Publishing
4      878353         Staffing and Recruiting

Preview of company_specialities — 169387 rows × 2 cols

   company_id              speciality
0    22292832      window replacement
1    22292832  patio door replacement
2       20300      Commercial Banking
3       20300          Retail Banking
4       20300                Mortgage

Preview of job_industries — 164808 rows × 2 cols

       job_id  industry_id
0  3884428798           82
1  3887473071           48
2  3887465684           41
3  3887467939           82
4  3887467939           80

### Schema overview & missing values profile

In [11]:
def profile(df: pd.DataFrame, name: str):
    if df is None: return None
    info = pd.DataFrame({
        'column': df.columns,
        'dtype': [df[c].dtype for c in df.columns],
        'non_null': [df[c].notna().sum() for c in df.columns],
        'nulls': [df[c].isna().sum() for c in df.columns],
        'null_pct': [round(100*df[c].isna().mean(),2) for c in df.columns],
        'nunique': [df[c].nunique(dropna=True) for c in df.columns],
    })
    info['table'] = name
    return info

profiles = []
for name, df in dfs.items():
    p = profile(df, name)
    if p is not None:
        profiles.append(p)
schema_profile = pd.concat(profiles, ignore_index=True)
schema_profile.sort_values(['table','column'])

        column    dtype  non_null  nulls  null_pct  nunique      table
19    inferred    int64     67943      0      0.00        2   benefits
18      job_id    int64     67943      0      0.00    30023   benefits
20        type   object     67943      0      0.00       12   benefits
8      address   object     24451     22      0.09    19476  companies
6         city   object     24472      1      0.00     4124  companies
..         ...      ...       ...    ...       ...      ...        ...
29  min_salary  float64     33947   6838     16.77     4620   salaries
30  pay_period   object     40785      0      0.00        5   salaries
25   salary_id    int64     40785      0      0.00    40785   salaries
35   skill_abr   object        35      0      0.00       35     skills
36  skill_name   object        35      0      0.00       35     skills

[68 rows x 7 columns]

## Dataset Cleaning 

This module provides a structured data-cleaning pipeline for the
*Data Science Job Postings 2025* dataset.

**Functionality:**

- **State Extraction:** Uses regular expressions to extract U.S. state abbreviations from the `headquarter` column and maps them to FIPS codes (`state`, `fips`, `fips_int` columns).
- **Salary Parsing:** Converts salary text ranges (e.g., "$80K–$120K") into numeric midpoints via normalization and numeric extraction (`salary_mid`).
- **Seniority Normalization:** Cleans and standardizes the `seniority_level` column to lowercase values, replacing invalid entries.
- **Skills Parsing:** Transforms stringified skill lists into clean Python lists (`skills_list`) by stripping brackets, quotes, and whitespace.
- **Deduplication:** Removes duplicate job postings using key columns (`job_title`, `company`, `location`, `post_date`, `salary`, `skills`).

In [1]:
from __future__ import annotations
import re
import pandas as pd

# --- Constants ---
STATE_ABBR = r"\b(AL|AK|AZ|AR|CA|CO|CT|DE|FL|GA|HI|ID|IL|IN|IA|KS|KY|LA|ME|MD|MA|MI|MN|MS|MO|MT|NE|NV|NH|NJ|NM|NY|NC|ND|OH|OK|OR|PA|RI|SC|SD|TN|TX|UT|VT|VA|WA|WV|WI|WY|DC)\b"
_ABBR_TO_FIPS = {
    'AL':'01','AK':'02','AZ':'04','AR':'05','CA':'06','CO':'08','CT':'09','DE':'10','DC':'11','FL':'12','GA':'13',
    'HI':'15','ID':'16','IL':'17','IN':'18','IA':'19','KS':'20','KY':'21','LA':'22','ME':'23','MD':'24','MA':'25',
    'MI':'26','MN':'27','MS':'28','MO':'29','MT':'30','NE':'31','NV':'32','NH':'33','NJ':'34','NM':'35','NY':'36',
    'NC':'37','ND':'38','OH':'39','OK':'40','OR':'41','PA':'42','RI':'44','SC':'45','SD':'46','TN':'47','TX':'48',
    'UT':'49','VT':'50','VA':'51','WA':'53','WV':'54','WI':'55','WY':'56'
}

_state_pat = re.compile(STATE_ABBR)


def extract_state(headquarter: pd.Series) -> pd.Series:
    def _one(x):
        s = str(x).upper()
        m = _state_pat.search(s)
        return m.group(1) if m else None
    return headquarter.astype(str).map(_one)


def parse_salary(s):
    """Return a numeric midpoint if salary is a range or single number, else None."""
    s = str(s)
    if not s or s.lower() in {"nan", "none"}:
        return None
    s_norm = s.replace("–", "-").lower()
    nums = [float(x.replace(",", "")) for x in re.findall(r"\d[\d,]*\.?\d*", s_norm)]
    if not nums:
        return None
    mid = (nums[0] + nums[1]) / 2 if len(nums) >= 2 else nums[0]
    if "k" in s_norm:
        mid *= 1000.0
    return mid


def parse_skills(s):
    """
    Turn "['python', 'sql']" or '["python","sql"]' or "python, sql" into a list.
    Keep it simple and lowercase.
    """
    if not isinstance(s, str) or not s.strip():
        return []
    parts = [x.strip(" '\"").lower() for x in s.strip("[]").split(",") if x.strip(" '\"")]
    return parts


def clean_jobs_df(df_raw: pd.DataFrame) -> pd.DataFrame:
    df = df_raw.copy()

    # --- state + fips ---
    df["state"] = extract_state(df.get("headquarter"))
    df["fips"] = df["state"].map(_ABBR_TO_FIPS)
    df["fips_int"] = pd.to_numeric(df["fips"], errors="coerce").astype("Int64")

    # --- salary ---
    df["salary_mid"] = df.get("salary", pd.Series([None] * len(df))).apply(parse_salary)

    # --- seniority ---
    df["seniority_level_norm"] = (
        df.get("seniority_level", pd.Series([None] * len(df)))
          .astype(str).str.lower().str.strip()
          .replace({"nan": pd.NA, "": pd.NA})
    )

    # --- skills ---
    skills_parsed = df.get("skills", pd.Series([None] * len(df))).apply(parse_skills)
    df["skills_list"] = skills_parsed
    # CSV-friendly version for Altair notebook
    df["skills_clean"] = skills_parsed.apply(lambda lst: "|".join(lst))

    # --- de-dup ---
    dedup_keys = ["job_title", "company", "location", "post_date", "salary", "skills"]
    existing = [c for c in dedup_keys if c in df.columns]
    if existing:
        df = df.drop_duplicates(subset=existing)

    return df


if __name__ == "__main__":
    in_path = "../data/data_science_job_posts_2025.csv"
    out_path = "../data/data_science_job_posts_2025_clean.csv"
    raw = pd.read_csv(in_path, low_memory=False)
    clean = clean_jobs_df(raw)
    clean.to_csv(out_path, index=False)
    print(f"Completed cleaning. new cleaned Dataset created at → {out_path}\n")

Completed cleaning. new cleaned Dataset created at → ../data/data_science_job_posts_2025_clean.csv